// Написать программу вычисления значения функции y = f(a)   y=sin(a)

Console.WriteLine("введите число");
double x = Convert.ToInt32(Console.ReadLine());
double y = Math.Sin(x);
Console.WriteLine(y);

