// Напишите программу, которая задаёт массив из N элементов (из диапазона [0-14] )
// и выводит на экран десятичное представление числа, записанного в СС по основанию 15
int n=10;
for (int i = 0; i < n; i++)
{
  Console.WriteLine($"{i}^3={i*i*i}");

}

 Console.WriteLine(myLybrary.ToDec(new int[] {9, 4, 12}));












